//როუტერი არის დასაინსტალირებელიდა ინსტალირდება npm install react-router-dom  მეშვეობით და
// დაინსტალირების შედეგი შეგვიძლია შევამოწმოთ ფექითჯეისონში.
//ფეიჯების ერთმანეთთან დაკავშირებისათვის ვიენებთ რეაქთ როუტერ ბიბლიოთეკას, რომელიც
// სტეიტივით მსგავსად ქმნის დამოკიდებულებას იუერელსა და აპლიკაციას შრის, 
// ანუ ხელით შეგვიძლია შევიყვანოთ რაღც მონაცემები იუერელის დონეზე,
// ანუ შესაძლებებლია ნაჯრებად დაჭრილი აპლიკაციიდან იუერელთან შეთანწყოობით მივღოთ სასურველი ნაჭერი.
//როუტერის ტიპები : regular rouT-yvelaze xSirad gamoyenebadi,აკვირდება კოდს და შესაბმის გვერდს გაწვდის, ანუ შექმნილი აქვს ერთგვარი ჯაჭვი იუერელთან.
//  index route- შეესაბამება მშობელ კომპონენტს,       layout route-გარე ფუნქციონალით,
//ვქმნით ფეიჯის ფოლდერს, ვქმნით როუტერ.ჯს ფაილს, აპპ.ჯსხ შემოგვაქვს <RouterProvider router={createBrowserRouter (router)} /> და ვაიმპორტებთ.
//ფეიჯის ფოლდერში შექმნილი ფაილები გადამაქვს როიტერის ფაილში
//ვქმნით ლეიაუთს და იქ ვათავსებთ ფეიჯებს როგორს ჩილდრენებს, და იქბე ვწერს ნავის ლინკებს
//პარამეტრიზირებული როუტი- ყველაფერი რასაც ვწერთ სტატიკურია, იმისათვის რომრაღაც დინამიური გვქოდეთ შევქმნათ პარამფეიჯი
//დინამიური გვერდი შეიძლება იყოს სტატიკურიც, რაში შეიძლება გამოგვადეს დინამიური გვერდი?
//ვაილდქარდ როუტი- მოქმედებს მაშინ როცა მისწინ არაფერი არ ამოქმედდა, ანუ ერორი.